---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowBoundary2d
source: html/7eb553e5-3aff-e93b-f791-47cd6471d0f8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowBoundary2d Property

"Show Stairs' Boundary 2D"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsDbgShowBoundary2d { get; }
```